---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.AreaLoadNotOverlappingHost
source: html/2a8a725e-c3d3-59bb-ba64-a1661c562119.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.AreaLoadNotOverlappingHost Property

Area load is not overlapping with its entire distribution its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId AreaLoadNotOverlappingHost { get; }
```